; domain
(define (domain millionaire)

  (:requirements
    :typing
    :numeric-fluents
    :negative-preconditions
  )

  (:types agent)

  (:predicates
    (has-company    ?a - agent)
    (joined-startup ?a - agent)
    (joined-megacorp ?a - agent)
    (has-licence    ?a - agent)
    (has-master     ?a - agent)
    (week-done      ?a - agent)
  )

  (:functions
    (money  ?a - agent)
    (health ?a - agent)
    (hours  ?a - agent)
  )

  (:action sleep
    :parameters (?a - agent)
    :precondition (< (health ?a) 80)
    :effect (and
      (when (<= (health ?a) 80) (increase (health ?a) 20))
      (when (>  (health ?a) 80) (assign (health ?a) 100))
    )
  )

  (:action vacation
    :parameters (?a - agent)
    :precondition (and
      (has-company ?a)
      (>= (money ?a) 10000)
      (>= (hours ?a) 120)
    )
    :effect (and
      (decrease (money  ?a) 10000)
      (when (<= (health ?a) 40) (increase (health ?a) 60))
      (when (>  (health ?a) 40) (assign (health ?a) 100))
      (increase (hours  ?a) 24)
      (not (week-done ?a))
    )
  )

  (:action join-startup
    :parameters (?a - agent)
    :precondition (has-licence ?a)
    :effect (and
      (has-company    ?a)
      (joined-startup ?a)
    )
  )

  (:action join-megacorp
    :parameters (?a - agent)
    :precondition (has-master ?a)
    :effect (and
      (has-company     ?a)
      (joined-megacorp ?a)
    )
  )

  (:action work-startup
    :parameters (?a - agent)
    :precondition (and
      (joined-startup ?a)
      (>= (health ?a) 50)           ; healthCostWork(40) + 10
    )
    :effect (and
      (increase (money  ?a) 40000)
      (decrease (health ?a) 40)
      (increase (hours  ?a) 40)
      (when (>= (hours ?a) 40) (week-done ?a))
    )
  )

  (:action work-megacorp
    :parameters (?a - agent)
    :precondition (and
      (joined-megacorp ?a)
      (>= (health ?a) 50)           ; healthCostWork(40) + 10
    )
    :effect (and
      (increase (money  ?a) 60000)
      (decrease (health ?a) 40)
      (increase (hours  ?a) 40)
      (when (>= (hours ?a) 40) (week-done ?a))
    )
  )

  (:action overtime-startup
    :parameters (?a - agent)
    :precondition (and
      (joined-startup ?a)
      (week-done ?a)
      (>= (health ?a) 55)           ; healthCostOT(45) + 10
    )
    :effect (and
      (increase (money  ?a) 80000)
      (decrease (health ?a) 45)
      (increase (hours  ?a) 20)
    )
  )

  (:action overtime-megacorp
    :parameters (?a - agent)
    :precondition (and
      (joined-megacorp ?a)
      (week-done ?a)
      (>= (health ?a) 60)           ; healthCostOT(50) + 10
    )
    :effect (and
      (increase (money  ?a) 120000)
      (decrease (health ?a) 50)
      (increase (hours  ?a) 20)
    )
  )

  (:action study-university
    :parameters (?a - agent)
    :precondition (and
      (not (has-licence ?a))
      (>= (money  ?a) 5000)
      (>= (health ?a) 35)           ; healthCost(25) + 10
    )
    :effect (and
      (has-licence      ?a)
      (decrease (money  ?a) 5000)
      (decrease (health ?a) 25)
      (increase (hours  ?a) 320)
    )
  )

  (:action study-highschool
    :parameters (?a - agent)
    :precondition (and
      (not (has-master ?a))
      (>= (money  ?a) 20000)
      (>= (health ?a) 45)           ; healthCost(35) + 10
    )
    :effect (and
      (has-master       ?a)
      (decrease (money  ?a) 20000)
      (decrease (health ?a) 35)
      (increase (hours  ?a) 480)
    )
  )
)

; problem
(define (problem becoming-rich)

  (:domain millionaire)

  (:objects
    alice - agent
  )

  (:init
    (= (money  alice) 7000)
    (= (health alice) 100)
    (= (hours  alice) 0)
  )

  (:goal (and
    (>= (money  alice) 500000)
    (>= (health alice) 80)
  ))

  (:metric minimize (total-cost))
)

; plan
1. (study-university alice)
   added: (has-licence alice)
   changed: (money alice) from 7000 to 2000, (health alice) from 100 to 75, (hours alice) from 0 to 320
   goals met: 0 of 2
2. (join-startup alice)
   added: (has-company alice) (joined-startup alice)
   goals met: 0 of 2
3. (sleep alice)
   changed: (health alice) from 75 to 95
   goals met: 1 of 2
4. (work-startup alice)
   added: (week-done alice)
   changed: (money alice) from 2000 to 42000, (health alice) from 95 to 55, (hours alice) from 320 to 360
   goals met: 0 of 2
5. (vacation alice)
   deleted: (week-done alice)
   changed: (money alice) from 42000 to 32000, (health alice) from 55 to 100, (hours alice) from 360 to 384
   goals met: 1 of 2
6. (study-highschool alice)
   added: (has-master alice)
   changed: (money alice) from 32000 to 12000, (health alice) from 100 to 65, (hours alice) from 384 to 864
   goals met: 0 of 2
7. (join-megacorp alice)
   added: (joined-megacorp alice)
   goals met: 0 of 2
8. (work-megacorp alice)
   added: (week-done alice)
   changed: (money alice) from 12000 to 72000, (health alice) from 65 to 25, (hours alice) from 864 to 904
   goals met: 0 of 2
9. (sleep alice)
   changed: (health alice) from 25 to 45
   goals met: 0 of 2
10. (vacation alice)
   deleted: (week-done alice)
   changed: (money alice) from 72000 to 62000, (health alice) from 45 to 100, (hours alice) from 904 to 928
   goals met: 1 of 2
11. (work-megacorp alice)
   added: (week-done alice)
   changed: (money alice) from 62000 to 122000, (health alice) from 100 to 60, (hours alice) from 928 to 968
   goals met: 0 of 2
12. (overtime-megacorp alice)
   changed: (money alice) from 122000 to 242000, (health alice) from 60 to 10, (hours alice) from 968 to 988
   goals met: 0 of 2
13. (sleep alice)
   changed: (health alice) from 10 to 30
   goals met: 0 of 2
14. (vacation alice)
   deleted: (week-done alice)
   changed: (money alice) from 242000 to 232000, (health alice) from 30 to 90, (hours alice) from 988 to 1012
   goals met: 1 of 2
15. (work-startup alice)
   added: (week-done alice)
   changed: (money alice) from 232000 to 272000, (health alice) from 90 to 50, (hours alice) from 1012 to 1052
   goals met: 0 of 2
16. (work-megacorp alice)
   changed: (money alice) from 272000 to 332000, (health alice) from 50 to 10, (hours alice) from 1052 to 1092
   goals met: 0 of 2
17. (sleep alice)
   changed: (health alice) from 10 to 30
   goals met: 0 of 2
18. (vacation alice)
   deleted: (week-done alice)
   changed: (money alice) from 332000 to 322000, (health alice) from 30 to 90, (hours alice) from 1092 to 1116
   goals met: 1 of 2
19. (work-startup alice)
   added: (week-done alice)
   changed: (money alice) from 322000 to 362000, (health alice) from 90 to 50, (hours alice) from 1116 to 1156
   goals met: 0 of 2
20. (work-megacorp alice)
   changed: (money alice) from 362000 to 422000, (health alice) from 50 to 10, (hours alice) from 1156 to 1196
   goals met: 0 of 2
21. (sleep alice)
   changed: (health alice) from 10 to 30
   goals met: 0 of 2
22. (vacation alice)
   deleted: (week-done alice)
   changed: (money alice) from 422000 to 412000, (health alice) from 30 to 90, (hours alice) from 1196 to 1220
   goals met: 1 of 2
23. (work-startup alice)
   added: (week-done alice)
   changed: (money alice) from 412000 to 452000, (health alice) from 90 to 50, (hours alice) from 1220 to 1260
   goals met: 0 of 2
24. (work-megacorp alice)
   changed: (money alice) from 452000 to 512000, (health alice) from 50 to 10, (hours alice) from 1260 to 1300
   goals met: 1 of 2
25. (sleep alice)
   changed: (health alice) from 10 to 30
   goals met: 1 of 2
26. (vacation alice)
   deleted: (week-done alice)
   changed: (money alice) from 512000 to 502000, (health alice) from 30 to 90, (hours alice) from 1300 to 1324
   goals met: 2 of 2
